In [1]:
import pandas as pd
import numpy as np

# DataFrame groupby method

## Tasks

Write your code in the python cells, following the comments, so that you output must be equal to the given

### Task 1: Find average sales for each product

Create sample DataFrame with product sales data and calculate the average sales for each product.

In [2]:
# Create sample DataFrame

  Product  Sales
0       A    100
1       B    150
2       A    200
3       B    300
4       A    250
5       C    400

In [3]:
# Calculate the average sales for each product.

Product
A    183.333333
B    225.000000
C    400.000000
Name: Sales, dtype: float64

### Task 2: Calculate class stats

Given a DataFrame with student scores, calculate the minimum, maximum, and average score for each class.

In [4]:
# Sample DataFrame
data = {
    'Class': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 90, 78, 88, 92, 95]
}
df = pd.DataFrame(data)
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [5]:
# calculate the minimum, maximum, and average score for each class.

Min score per class:
         Score
Class
Math        78
Science     88

Max score per class:
         Score
Class
Math        92
Science     95

Average score per class:
         Score
Class
Math      85.0
Science   91.0

### Task 3: Count number of orders in each category

Given a DataFrame with product order data,  count the number of orders in each category.

In [6]:
# Sample DataFrame
data = {
    'OrderID': [101, 102, 103, 104, 105, 106],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Electronics', 'Furniture']
}
df = pd.DataFrame(data)
df

   OrderID     Category
0      101  Electronics
1      102     Clothing
2      103  Electronics
3      104     Clothing
4      105  Electronics
5      106    Furniture

In [7]:
# count the number of orders in each category.

Category
Clothing       2
Electronics    3
Furniture      1
dtype: int64

### Tasks on drinks dataset

#### Task 0: Load [drinks.csv](https://github.com/geekcourses/JupyterNotebooksExamples/blob/master/datasets/various/drinks.csv) and show the first 5 rows

In [8]:
# load datasets

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

#### Task 1: Calculate the average beer servings for each continent.

In [9]:
# your code here

Average Beer Servings by Continent:

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

#### Task 2: Which continent consumes max wine in total

In [10]:
# your code here

Total Wine Servings by Continent:
EU

#### Task 3: Identify the country with the highest beer servings within each continent.

In [11]:
# your code here

Countries with the Highest Beer Servings in Each Continent:
                country continent  beer_servings
117             Namibia        AF            376
141  Russian Federation        AS            247
45       Czech Republic        EU            361
129               Palau        OC            306
188           Venezuela        SA            333

#### Task 4: Calculate the sum of all alcoholic beverage servings (beer, spirit, wine) by continent.

In [12]:
# your code here

Sum of All Alcoholic Beverage Servings by Continent:
           beer_servings  spirit_servings  wine_servings
continent
AF                  3258              866            862
AS                  1630             2677            399
EU                  8720             5965           6400
OC                  1435              935            570
SA                  2101             1377            749

#### Task 5: Find countries where the total litres of pure alcohol is above the global average.

In [13]:
# your code here

Countries with Above Average Total Alcohol Consumption (<4.717098445595855):

               country  total_litres_of_pure_alcohol
1              Albania                           4.9
3              Andorra                          12.4
4               Angola                           5.9
5    Antigua & Barbuda                           4.9
6            Argentina                           8.3
..                 ...                           ...
182     United Kingdom                          10.4
183           Tanzania                           5.7
184                USA                           8.7
185            Uruguay                           6.6
188          Venezuela                           7.7

[90 rows x 2 columns]